import random
e = 0
f = 0
g = 0
while True:
    a = random.choice(["ค้อน","กรรไกร","กระดาษ"])
    print(a)
    b = str(input("คุณเลือก : "))
    if b == a:
        print("เสมอ")
        g +=1
        print("-------------------------------------------------")
    elif(b =="ค้อน" and  a == "กรรไกร"):
        print("ชนะ")
        e +=1
        print("-------------------------------------------------")
    elif(b =="กรรไกร" and  a == "กระดาษ"):
        print("ชนะ")
        e +=1
        print("-------------------------------------------------")
    elif(b =="กระดาษ" and  a == "ค้อน"):
        print("ชนะ")
        e +=1
        print("-------------------------------------------------")
    elif b == "ออกเกม":
        break
    else:
        print("แพ้")
        f +=1
        print("-------------------------------------------------")
print(f"คุณชนะทั่งหมด  {e} รอบ")
print(f"คุณแพ้ทั่งหมด  {f} รอบ")
print(f"คุณเสมอทั่งหมด  {g} รอบ")
print(f"รวมทั่งหมด  {g+f+e} รอบ")
print("-------------------------------------------------")